--
-- Author: lyx
-- Date: 2018/10/9
-- Time: 15:14
-- 说明：自由场个人的水池VIP调整配置 在对应的目标基础值上进行加法运算

local config = {

	default = {
		-- 一级 抽水/放水 线
		water_line1 = {0,0},
		-- 二级 抽水/放水 线
		water_line2 = {0,0},
		-- 连续N次无奖时，触发奖励返利
		award_fail_max = 0,
	},

	-- 场次 1 配置（经典斗地主--新手场）
    [1] = {

    	-- VIP等级
    	[1] = {
			-- 一级 抽水/放水 线
			water_line1 = {-9000,18000},
			-- 二级 抽水/放水 线
			water_line2 = {-21600,43200},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},

    	[2] = {
			-- 一级 抽水/放水 线
			water_line1 = {-27000,54000},
			-- 二级 抽水/放水 线
			water_line2 = {-50400,100800},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
		
		[3] = {
			-- 一级 抽水/放水 线
			water_line1 = {-63000,126000},
			-- 二级 抽水/放水 线
			water_line2 = {-102200,208800},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
		
		[4] = {
			-- 一级 抽水/放水 线
			water_line1 = {-63000,126000},
			-- 二级 抽水/放水 线
			water_line2 = {-104400,208800},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
		
		[5] = {
			-- 一级 抽水/放水 线
			water_line1 = {-63000,126000},
			-- 二级 抽水/放水 线
			water_line2 = {-104400,208800},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
		
		[6] = {
			-- 一级 抽水/放水 线
			water_line1 = {-63000,126000},
			-- 二级 抽水/放水 线
			water_line2 = {-104400,208800},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
		
		[7] = {
				-- 一级 抽水/放水 线
			water_line1 = {-63000,126000},
			-- 二级 抽水/放水 线
			water_line2 = {-104400,208800},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
		
		[8] = {
				-- 一级 抽水/放水 线
			water_line1 = {-63000,126000},
			-- 二级 抽水/放水 线
			water_line2 = {-104400,208800},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
		
		[9] = {
				-- 一级 抽水/放水 线
			water_line1 = {-63000,126000},
			-- 二级 抽水/放水 线
			water_line2 = {-104400,208800},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
		
		[10] = {
				-- 一级 抽水/放水 线
			water_line1 = {-63000,126000},
			-- 二级 抽水/放水 线
			water_line2 = {-104400,208800},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
				
	},
	
	-- 场次 2 配置（经典斗地主--三星场）
	[2] = {

    	-- VIP等级
    	[1] = {
			-- 一级 抽水/放水 线
			water_line1 = {-18000,36000},
			-- 二级 抽水/放水 线
			water_line2 = {-36000,72000},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},

    	[2] = {
			-- 一级 抽水/放水 线
			water_line1 = {-72000,144000},
			-- 二级 抽水/放水 线
			water_line2 = {-144000,288000},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
		
		[3] = {
			-- 一级 抽水/放水 线
			water_line1 = {-126000,252000},
			-- 二级 抽水/放水 线
			water_line2 = {-252000,504000},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
		
		[4] = {
			-- 一级 抽水/放水 线
			water_line1 = {-270000,540000},
			-- 二级 抽水/放水 线
			water_line2 = {-540000,1080000},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
		
		[5] = {
			-- 一级 抽水/放水 线
			water_line1 = {-270000,540000},
			-- 二级 抽水/放水 线
			water_line2 = {-540000,1080000},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
		
		[6] = {
			-- 一级 抽水/放水 线
			water_line1 = {-270000,540000},
			-- 二级 抽水/放水 线
			water_line2 = {-540000,1080000},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
		
		[7] = {
			-- 一级 抽水/放水 线
			water_line1 = {-270000,540000},
			-- 二级 抽水/放水 线
			water_line2 = {-540000,1080000},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
		
		[8] = {
			-- 一级 抽水/放水 线
			water_line1 = {-270000,540000},
			-- 二级 抽水/放水 线
			water_line2 = {-540000,1080000},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
		
		[9] = {
			-- 一级 抽水/放水 线
			water_line1 = {-270000,540000},
			-- 二级 抽水/放水 线
			water_line2 = {-540000,1080000},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
		
		[10] = {
			-- 一级 抽水/放水 线
			water_line1 = {-270000,540000},
			-- 二级 抽水/放水 线
			water_line2 = {-540000,1080000},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},

	},
	-- 场次 3配置（经典斗地主--四星场）
	[3] = {

    	-- VIP等级
    	[1] = {
			-- 一级 抽水/放水 线
			water_line1 = {-48000,96000},
			-- 二级 抽水/放水 线
			water_line2 = {-72000,144000},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},

    	[2] = {
			-- 一级 抽水/放水 线
			water_line1 = {-192000,384000},
			-- 二级 抽水/放水 线
			water_line2 = {-360000,720000},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
		
		[3] = {
			-- 一级 抽水/放水 线
			water_line1 = {-432000,864000},
			-- 二级 抽水/放水 线
			water_line2 = {-840000,1680000},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
		
		[4] = {
			-- 一级 抽水/放水 线
			water_line1 = {-912000,1824000},
			-- 二级 抽水/放水 线
			water_line2 = {-1800000,3600000},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
		
		[5] = {
			-- 一级 抽水/放水 线
			water_line1 = {-1152000,2304000},
			-- 二级 抽水/放水 线
			water_line2 = {-2280000,4560000},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
		
		[6] = {
			-- 一级 抽水/放水 线
			water_line1 = {-1152000,2304000},
			-- 二级 抽水/放水 线
			water_line2 = {-2280000,4560000},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
		
		[7] = {
			-- 一级 抽水/放水 线
			water_line1 = {-1872000,3744000},
			-- 二级 抽水/放水 线
			water_line2 = {-3720000,7440000},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
		
		[8] = {
			-- 一级 抽水/放水 线
			water_line1 = {-1872000,3744000},
			-- 二级 抽水/放水 线
			water_line2 = {-3720000,7440000},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
		
		[9] = {
			-- 一级 抽水/放水 线
			water_line1 = {-1872000,3744000},
			-- 二级 抽水/放水 线
			water_line2 = {-3720000,7440000},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
		
		[10] = {
			-- 一级 抽水/放水 线
			water_line1 = {-1872000,3744000},
			-- 二级 抽水/放水 线
			water_line2 = {-3720000,7440000},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},

	},
	-- 场次 4配置（经典斗地主--五星场）
	[4] = {

    	-- VIP等级
    	[1] = {
			-- 一级 抽水/放水 线
			water_line1 = {-48000,96000},
			-- 二级 抽水/放水 线
			water_line2 = {-48000,96000},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},

    	[2] = {
			-- 一级 抽水/放水 线
			water_line1 = {-192000,384000},
			-- 二级 抽水/放水 线
			water_line2 = {-288000,576000},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
		
		[3] = {
			-- 一级 抽水/放水 线
			water_line1 = {-432000,864000},
			-- 二级 抽水/放水 线
			water_line2 = {-768000,1536000},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
		
		[4] = {
			-- 一级 抽水/放水 线
			water_line1 = {-912000,1824000},
			-- 二级 抽水/放水 线
			water_line2 = {-1728000,3456000},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
		
		[5] = {
			-- 一级 抽水/放水 线
			water_line1 = {-1362000,2784000},
			-- 二级 抽水/放水 线
			water_line2 = {-2208000,4416000},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
		
		[6] = {
			-- 一级 抽水/放水 线
			water_line1 = {-1872000,3744000},
			-- 二级 抽水/放水 线
			water_line2 = {-3648000,7296000},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
		
		[7] = {
			-- 一级 抽水/放水 线
			water_line1 = {-2352000,4704000},
			-- 二级 抽水/放水 线
			water_line2 = {-4608000,9216000},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
		
		[8] = {
			-- 一级 抽水/放水 线
			water_line1 = {-2352000,4704000},
			-- 二级 抽水/放水 线
			water_line2 = {-4608000,9216000},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
		
		[9] = {
			-- 一级 抽水/放水 线
			water_line1 = {-2352000,4704000},
			-- 二级 抽水/放水 线
			water_line2 = {-4608000,9216000},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},
		
		[10] = {
			-- 一级 抽水/放水 线
			water_line1 = {-2352000,4704000},
			-- 二级 抽水/放水 线
			water_line2 = {-4608000,9216000},
			-- 连续N次无奖时，触发奖励返利
			award_fail_max = 0,
    	},

	},
}


return config